import React, { Component } from 'react';
import blog_btn from './blog_btn.png';
import './style.css';

class Blog_articles extends Component {
  // constructor(props) {
  //   super(props);
  //   this.state = {text: null};
  //   this.handleChange = this.handleChange.bind(this);
  // }

  // handleChange(event) {
  //   this.setState({text: event.target.value});
  //   this.props.updateData(this.state.text);
  // }

  windowDown_1(e) {
    document.querySelector(".open_post-1").classList.toggle("hidden-1");
  }
  
  windowDown_2(e) {
    document.querySelector(".open_post-2").classList.toggle("hidden-2");
  }
  
  windowDown_3(e) {
    document.querySelector(".open_post-3").classList.toggle("hidden-3");
  }
  
  windowDown_4(e) {
    document.querySelector(".open_post-4").classList.toggle("hidden-4");
  }
  
  windowDown_5(e) {
    document.querySelector(".open_post-5").classList.toggle("hidden-5");
  }

  render() {
    return (
      <div className="tab" id="articles">
        <ul className="list_articles">
          <li className="preview articles_box">
            <div   href="#" id="articles_box">
              <h2 className="preview__title">Віддалене керування системою відеонагляду</h2>
              <p className="preview__text" >
              Мобільні пристрої тісно увійшли в життя сучасної людини. 
              В них зосереджено безліч мобільних додатків, які вирішують значний перелік завдань.
              Однією із таких можливостей є віддалений перегляд контролююємого об'єкту системою відеонагляду...
              </p>
              <a id="artcl_btn"  href="#blog_article_5" className="preview__more" onClick={this.windowDown_5}>Читати далі</a>
            </div>
            <div className="open_post-1 hidden-1">
              <img 
                className="blog_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_1} 
              />
              <h3>
               Розрахунок жорсткого диску для відео регістратора
              </h3>
              <p>
                При встановленні на об'єкті системи відеонагляду одне із питань яке виникає – 
                це який потрібен жорсткий диск у регістратор? Для вірної відповіді нам потрібно поділити це запитання 
                на дві основні частини:
              </p>
              <ul>
                <li>
                -	яку модель і марку HDD обрати;
                </li>
                <li>
                -	як визначити потрібний об’єм пам’яті.
                </li>
              </ul>
              <p>
              Щодо першого запитання однозначної відповіді немає, і основний принцип на яким потрібно керуватися 
              це фінанси які ми маємо, але ми б рекомендували звертатися до більш перевірених брендів,таких як :  
              TOSHIBA,SEAGATE,WD,HGST.
              </p>
              <p>
              Стосовно другої частини  – визначення ємкості HDD в залежності від умов експлуатації, 
              характеристик використовуваних камер відео нагляду і деяких інших параметрів.
              Почнемо із того,що ідеально точно об’єм у Вам розрахувати не вийде,справа в тому, що навіть один і 
              той же кодек стискає відеопоток по різному в залежності від ряду факторів: 
              </p>
              <ul>
                <li>
                -	наповненості кадру;
                </li>
                <li>
                -	інтенсивності руху і т.д.
                </li>
              </ul>
              <p>
              Окрім того, при використанні детектору руху , а сьогодні без нього не обходиться	ні один відео регістратор, 
              неможливо оцінити інтенсивність переміщення людей у кадрі . Тому при розрахунку беруть відсоток вищий від 
              ймовірного вищий на 10-20%.
              </p>
              <p>
              Варто пам’ятати , що навіть при використанні датчику руху, можливо використовувати налаштування, визначаючі 
              добовий або тижневий режим запису. Само собою, що якщо об’єктив у вихідні не працює то запис по датчику руху 
              теж не буде виконуватися.
              </p>
              <p>
              А при умові що відео нагляд встановлений наприклад на дачі, то у відсутність господарів запис повинен вестися 
              цілодобово і щотижнево , але інтенсивність роботи датчику руху буде дуже низькою . Так що можливі дуже різні 
              комбінації і варіанти.
              </p>
              <br />
              <p className="article_author">
                Холодний Артем
              </p>
              <span 
                className="close_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_1} 
            >
              Закрити
            </span>
          </div>
          </li>
          <li className="preview articles_box" >
            <div   href="#" id="articles_box">
              <h2 className="preview__title">"Хмарне" зберігання данних</h2>
              <p className="preview__text">Останнім часом все більшу популярніст отримує зберігання інформації в хмарних сервісах - 
              особливій моделі онлайн-зберігання. Ця модель базується на тому, що всі дані зберігаються в мережевому просторі без видимої прив'язки
              до конкретного серверу...
              </p>
              <a id="artcl_btn"  href="#blog_article_5" className="preview__more" onClick={this.windowDown_5}>Читати далі</a>
            </div>
          <div className="open_post-2 hidden-2">
            <div>
              <img 
                className="blog_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_2} 
              />
              <h3 className="">"Хмарне" зберігання данних</h3>
              <p className="">Останнім часом все більшу популярніст отримує зберігання інформації в хмарних сервісах - 
              особливій моделі онлайн-зберігання. Ця модель базується на тому, що всі дані зберігаються в мережевому просторі без видимої прив'язки
              до конкретного серверу...
              </p>
            </div>
          </div>
          </li>
          <li className="preview articles_box">
            <div   href="#" id="articles_box">
              <h2 className="preview__title">Доцільність використання альтернативних джерел енергетики на виробництві</h2>
              <p className="preview__text"> Біометричні системи доступу - це тип систем, які в якості ідентифікатора використовують 
              біометричні ознаки особи, а саме: підбиток пальця, сітківку ока, профіль облицця, тощо.
              Основною перевагою такої системи є укікальність ідентифікатора...
              </p>
              <a id="artcl_btn" href="#blog_article_5"  className="preview__more" onClick={this.windowDown_5}>Читати далі</a>
            </div>
            <div className="open_post-3 hidden-3">
              <img 
                className="blog_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_3} 
              />
            <h3>
                      Title #3
            </h3> 
            <p>
              Number #3
            </p>
            
            <span 
                className="close_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_3} 
            >
              Закрити
            </span>
          </div>
          </li>     
          <li className="preview articles_box">
            <div   href="#" id="articles_box">
              <h2 className="preview__title" >Правові аспекти встановлення системи відеонагляду</h2>
              <p className="preview__text">Питання законності встановлення системи відеонагляду в громадських місцях є досить актуальним.
              Особливої уваги воно оримало в останні роки, в зв'язку із значним поширенням систем безпеки в побуті...
              </p>
              <a id="artcl_btn" href="#blog_article_5"  className="preview__more" onClick={this.windowDown_5}>Читати далі</a>
            </div>
            <div className="open_post-4 hidden-4">
              <img 
                className="blog_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_4} 
              />
              <h3>
                  Title 4
              </h3>

              
            <span 
                className="close_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_4} 
            >
              Закрити
            </span>
          </div>
          </li> 
          {/* <li className="preview articles_box" props={ this.handleChange.bind(this) }> */}
          <li className="preview articles_box" >
            <div   href="#"  id="articles_box">
              <h2 className="preview__title">Маркування мережевого кабелю</h2>
              <p className="preview__text">
                Будь-яка локальна мережа  будується на Ethernet-кабелі. 
                Якщо Ви зіштовхуватися із проблемою вибору кабелю для мережі Ethernet і 
                не розумієте який саме необхідний - ми  допоможемо Вам із 
                вирішенням цього питання...
              </p>
            <a id="artcl_btn" href="#blog_article_5" className="preview__more" onClick={this.windowDown_5}>Читати далі</a>
          </div>
            <div className="open_post-5 hidden-5">
              <h3 className="article_title">Маркування мережевого кабелю</h3>
              <img 
                className="blog_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_5} 
              />
            <p>
              Будь-яка локальна мережа  будується на Ethernet-кабелі. 
              Якщо Ви зіштовхуватися із проблемою вибору кабелю для мережі Ethernet і 
              не розумієте який саме необхідний - ми  допоможемо Вам із 
              вирішенням цього питання.
            </p>
            <p>          
              Спочатку розберемо що являє собою поняття «CAT» у маркуванні кабелю?
              Взагалі маркування «CAT» просто позначає «Category» - категорія, а наступна цифра вказує 
              на технічна характеристики , для яких був виготовлений кабель. Загальне правило полягає в тому, 
              що чим більша цифра , тим більш високі показники швидкості і вищі частоти (МГц). 
              Як і в більшості технологій , нові кабелі	мають тенденцію до підвищення пропускної можливості, 
              а як наслідок, підвищення швидкості завантаження і пришвидшення з’єднання .
              Загальна класифікація поділяє їх так :
            </p>
            <ul className="article_list">
              <li>
                CAT 1 — телефонний кабель, всього одна пара. В США використовувався раніше, і провідники були 
                скручені між собою. Використовується тільки для передачі голосуабо даних за допомогою модему. 
                Смуга частот 0,1-0,4 МГц.
              </li>
              <li>
                CAT 2 — старий тип кабелю з 2-х пар провідників, підтримував передачу даних на швидкостях до 4 Мбіт/с, 
                використовувався в мережах token ring і ARCNet. Зараз іноді зустрічається в телефонних мережах. Смуга частот 1-4 МГц.
             </li>
              <li>
                CAT 3 — 2-парний кабель, використовувався для побудові локальних мереж 10BASE-T і token ring, підтримує швидкість 
                передачі даних тільки до 10 Мбіт/с. На відміну від попередніх двох, відповідає вимогам стандарту IEEE 802.3. Також дотепер 
                зустрічається в телефонних мережах. Смуга частот 16 МГц.
              </li>
              <li>
                CAT 4 — кабель складається з 4-х скручених пар, використовувався в мережах token ring, 10BASE-T, 10BASE-T4, 
                швидкість передачі даних не перевищує 16 Мбіт/с, зараз не використовується. Смуга частот 20 МГц.
              </li>
              <li>
                САТ 5 — 4-парний кабель, це і є те, що зазвичай називають кабель «вита пара». Використовується при побудові 
                локальних мереж 10BASE-T, 100BASE-TX і 1000BASE-T і для прокладки телефонних ліній, підтримує швидкість передачі 
                даних до 100 Мбіт/с при використанні 2 пар і до 1000 Мбіт/с при використанні 4 пар. Смуга частот 100 МГц.
              </li>
              <li>
                CAT 5e — 4-парний кабель, вдосконалена категорія 5 (уточнені / поліпшені специфікації). Швидкість передач даних до 100 Мбіт/с 
                при використанні 2 пар і до 1000 Мбіт/с при використанні 4 пар. Кабель категорії 5e є найпоширенішим і використовується для 
                побудови комп'ютерних мереж. Іноді зустрічається двохпарний кабель категорії 5e. Переваги даного кабелю в нижчій собівартості 
                і меншій товщині. Смуга частот 100 МГц.
              </li>
              <li>
                CAT 6 — Застосовується в мережах Fast Ethernet і Gigabit Ethernet, складається з 4 пар провідників і здатний 
                передавати дані на швидкості до 10000 Мбіт/с. Доданий до стандарту в червні 2002 року, пропускає сигнали 
                частотою до 200МГц. Існує категорія CAT6е, в якій збільшена частота сигналу, що пропускається, до 500МГц. 
                За даними IEEE, 70% встановлених мереж у 2004 році використовували кабель категорії CAT6, проте, можливо, це 
                просто данина моді, бо й кабелі CAT5 і CAT5e цілком справляються в мережах 10GBASE-T. Смуга частот 250 МГц.
              </li>
              <li>
                CAT 6A — складається з 4 пар провідників і здатний передавати дані на швидкості до 10 Гбіт/с на відстань до 100 метрів. 
                Доданий в стандарт ISO/IEC 11801:2002 поправка 2 в лютому 2008 року. Кабель цієї категорії має або загальний екран (F/UTP), 
                або екрани навколо кожної пари (U/FTP). Смуга частот 500 МГц.
              </li>
              <li>
                CAT 7 — специфікація на даний тип кабелю затверджена тільки міжнародним стандартом ISO 11801, але не ANSI/TIA-568-C. Швидкість 
                передачі даних — до 10000 Мбіт/с, частота сигналу, що пропускається, до 600–700 Мгц. Кабель цієї категорії екранований.
              </li>
              <li>
                CAT 7A — міжнародний стандарт ISO 11801, швидкість передачі даних до 10 Гбіт/с. Загальний екран і екрани навколо кожної пари 
                (F/FTP або S/FTP). Смуга частот 1000 МГц.
              </li>
              <li>
                CAT 8/CAT 8.1 — у розробці, технічна рекомендація ISO/IEC TR 11801-99-1 і міжнародний стандарт ISO 11801 редакція 3 (для Cat.8.1),
                 американський стандарт ANSI/TIA-568-C.2-1 (для Cat. 8). Повністю сумісний з кабелем категорії 6A. Швидкість передачі даних до 40 
                 Гбіт/с при використанні стандартних конекторів 8P8C. Кабель цієї категорії має або загальний екран, або екрани навколо кожної пари 
                 (F/UTP або U/FTP). Смуга частот 1600-2000 МГц.
              </li>
              <li>
                CAT 8.2 — у розробці, міжнародний стандарт ISO 11801 редакція 3. Повністю сумісний з кабелем категорії 7A. Швидкість передачі 
                даних до 40 Гбіт/с при використанні стандартних конекторів 8P8C або GG45/ARJ45 і TERA. Кабель цієї категорії має загальний екран і 
                екрани навколо кожної пари (F/FTP або S/FTP). Смуга частот 1600-2000 МГц.
              </li>
            </ul>
            {/* <p>
              Після маркування «CAT» наступний важливий момент в виборі кабелю є екранування.
              Для захисту від електричних завад при використанні високочастотних сигналів, в кабелях категорій 6A−8 обов'язково 
              використовується екранування. Екранування застосовується як до окремих кручених пар, які обертаються в алюмінієву фольгу 
              (металізовану алюмінієм поліетиленову стрічку), так і до кабелю в цілому у вигляді загального екрану з фольги та / або обплетення 
              з мідного дроту. Екран також може бути з'єднаний з неізольованим дренажним проводом, який служить для заземлення та механічно 
              підтримує екран в разі поділу на секції при зайвому вигині або розтягуванні кабелю.
            </p> */}
            {/* <p>
              Згідно з міжнародним стандартом ISO/IEC 11801:2002 додаток E, для позначення конструкції екранованого кабелю використовується 
              комбінація з трьох букв: U — неекранований, S — металеве обплетення (тільки загальний екран), F — металізована стрічка 
              (алюмінієва фольга). З цих букв формується абревіатура виду xx/xTP, що позначає тип загального екрану і тип екрану для окремих пар.
            </p>
            <ul>
             Поширені такі типи конструкції екрана:
            <li>
              Неекранований кабель (U/UTP) — екранування відсутнє. Категорія 6 і нижче.
            </li>
            <li>
              Індивідуальний екран (U/FTP) — екранування фольгою кожних окремих пар. Захищає від зовнішніх перешкод і від перехресних 
              перешкод між крученими парами.
            </li>
            <li>
              Загальний екран (F/UTP, S/UTP, SF/UTP) — загальний екран з фольги, обплетення, або фольги з обплетенням. Захищає від зовнішніх електромагнітних перешкод.
            </li>
            <li>
              Індивідуальний і загальний екран (F/FTP, S/FTP, SF/FTP) — індивідуальні екрани з фольги для кожної кручений пари, плюс загальний екран з фольги, обплетення, 
              або фольги з обплетенням. Захищає від зовнішніх перешкод і від перехресних перешкод між крученими парами.
            </li>
            <li>
              Екрановані кабелі категорій 5e, 6/6A і 8/8.1 найчастіше використовують конструкцію F/UTP (загальний екран з фольги), тоді як екрановані 
              кабелі категорій 7/7A і 8.2 використовують конструкцію S/FTP (із загальним металевим обплетенням і фольгою для кожної пари).
            </li>
            <li>
              Літерний код перед зворотньою рискою позначає тип загального екрану для всього кабелю, код після риски позначає тип індивідуального 
              захисту, для кожної кручений пари:
            </li>
            <li>
              U = unshielded, без екрану
            </li>
            <li>
              F = foil, фольга
            </li>
            <li>
              S = braided screening, обплетення з дроту (тільки зовнішній екран)
            </li>
            <li>
              TP = twisted pair, звита пара         
            </li>
            </ul>
            <p>
            І додамо трохи практики, а саме обтискання кабелю найпоширенішої категорії	CAT 5.
            Для того, щоб комп'ютерна мережа працювала правильно, прокладаючи кабель, необхідно з'єднати відповідні контакти на роз'ємах 8P8C 
            (який помилково ще називають RJ-45) у певному порядку і з одного, і з іншого кінця. Цю послідовність позначають кольорами проводів; 
            при достатньому знанні можна скласти послідовність на власний розсуд, проте це може стати джерелом плутанини у великих мережах. 
            </p>
            <ul>
              Тому при прокладанні витої пари користуються двома стандартними схемами обтискання проводів на роз'єми:
              <li>
                прямий порядок обтискання — для з'єднання мережевої карти з комутатором або концентратором;
              </li>
              <li>
                перехрещений (кросований) з інвертованою розводкою контактів роз'ємів. Застосовується для з'єднання двох комп'ютерів і для з'єднання
                деяких старих моделей концентраторів та комутаторів.
              </li>
            </ul>
            <p>
              Так як кросований порядок обтискання уже зараз не актуальний, то розберемося з прямим порядком обтискання:
            </p>
            <ul>
              Існує два стандартних варіанти обтискання прямого кабелю: 
              <li>
                Варіант за стандартом EIA/TIA-568A (часто позначають просто 568A)
              </li>
              <li>
                Варіант за стандартом EIA/TIA-568B — застосовується найчастіше
              </li>
            </ul>
            <p>
              Як вибирати такі кабелі?
              Найпростіший спосіб вибрати кабель - вибрати той, який вам підходить. Але що вам потрібно?   Почніть з швидкості 
              вашого домашнього інтернет-з'єднання. Якщо у вас Gigabit інтернет, старий кабель Ethernet буде сповільнювати вас. 
              Але якщо у вас повільний зв'язок, скажімо, 10 або 20 мегабіт в секунду, вам підійде Cat5 або більш нові кабелі.   
              Далі розглянемо швидкість, необхідну для вашої мережі. Це просто не актуальне для більшості домашніх користувачів. 
              Але якщо ви часто передаєте великі файли між комп'ютерами або ви передаєте відео високої чіткості, кращий Ethernet-кабель може 
              змінити ситуацію. Нарешті, розглянемо ваш маршрутизатор. Так як дешеві маршрутизатори підтримують швидкість тільки до 100 мегабіт 
              в секунду, вони будуть перешкоджати передачі даних вище, ніж Cat 5. Навіть найкращі домашні маршрутизатори рідко підтримують більше, 
              ніж Gigabit Ethernet, тому застосування Cat 6a і Cat 7 під питанням.
            </p> */}
            <p>
              З огляду на все вищевикладене, кабель Cat 6 - це більше, що вам може знадобитися, в більшості домашніх мереж можна спокійно 
              використовувати Cat 5e.
            </p>
            <br />
            <p className="article_author">
              Холодний Артем
            </p>
            <span 
                className="close_btn" 
                src={ blog_btn } 
                onClick={this.windowDown_5} 
            >
              Закрити
            </span>
           </div>
           </li>
        </ul>
      </div>
    );
  }
}

export default Blog_articles;